{
    "url": "http://books.toscrape.com",
    "content": "All products | Books to Scrape - Sandbox Books to Scrape We love being scraped! Home All products Books Travel Mystery Historical Fiction Sequential Art Classics Philosophy Romance Womens Fiction Fiction Childrens Religion Nonfiction Music Default Science Fiction Sports and Games Add a comment Fantasy New Adult Young Adult Science Poetry Paranormal Art Psychology Autobiography Parenting Adult Fiction Humor Horror History Food and Drink Christian Fiction Business Biography Thriller Contemporary Spirituality Academic Self Help Historical Christian Suspense Short Stories Novels Health Politics Cultural Erotica Crime All products 1000 results - showing 1 to 20. Warning! This is a demo website for web scraping purposes. Prices and ratings here were randomly assigned and have no real meaning. A Light in the ... Â£51.77 In stock Add to basket Tipping the Velvet Â£53.74 In stock Add to basket Soumission Â£50.10 In stock Add to basket Sharp Objects Â£47.82 In stock Add to basket Sapiens: A Brief History ... Â£54.23 In stock Add to basket The Requiem Red Â£22.65 In stock Add to basket The Dirty Little Secrets ... Â£33.34 In stock Add to basket The Coming Woman: A ... Â£17.93 In stock Add to basket The Boys in the ... Â£22.60 In stock Add to basket The Black Maria Â£52.15 In stock Add to basket Starving Hearts (Triangular Trade ... Â£13.99 In stock Add to basket Shakespeare's Sonnets Â£20.66 In stock Add to basket Set Me Free Â£17.46 In stock Add to basket Scott Pilgrim's Precious Little ... Â£52.29 In stock Add to basket Rip it Up and ... Â£35.02 In stock Add to basket Our Band Could Be ... Â£57.25 In stock Add to basket Olio Â£23.88 In stock Add to basket Mesaerion: The Best Science ... Â£37.59 In stock Add to basket Libertarianism for Beginners Â£51.33 In stock Add to basket It's Only the Himalayas Â£45.17 In stock Add to basket Page 1 of 50 next"
}